SET NAMES 'utf8';
DROP DATABASE IF EXISTS flower;
CREATE DATABASE flower CHARSET=UTF8;
USE flower;

CREATE TABLE lv_flower(
    did INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64),
    price FLOAT(6,2),
    img_sm VARCHAR(64),
    img_lg VARCHAR(64),
    detail VARCHAR(2048),
    material VARCHAR(2048)
);
INSERT INTO lv_flower(did,img_sm,img_lg,name,price,material,detail) VALUES
(   null,
    'gougu_s.png',
    'gougu.jpg',
    '【枸骨】',
    46,
    '枸骨，别名：鸟不宿、猫儿刺、枸骨冬青、八角刺。',
    '孤植配假山石或花坛中心，丛植于草坪或道路转角处，也可在建筑的门庭两帝或路口对值。宜作刺绿篱，兼有防护与观赏效果。盆栽作室内装饰，老桩作舆景，既可观赏自然树形，也可修剪造型。叶、果枝可插花。 '
),
(   null,
    'guihua_s.png',
    'guihua.jpg',
    '【桂花】',
    68,
    '桂花是中国木犀属众多树木的习称，代表物种木犀。',
    '桂花清可绝尘，浓能远溢，堪称一绝。尤其是仲秋时节，丛桂怒放，夜静轮圆之际，把酒赏桂，陈香扑鼻，令人神清气爽。'
),
(   null,
    'hudiehua_s.png',
    'hudiehua.jpg',
    '【蝴蝶花】',
    32,
    '蝴蝶花，又叫琼花，忍冬科落叶或半常绿灌木，4、5月间开花，花大如盘，洁白如玉。',
    '蝴蝶花是以上帝的使者以及连接地球和其它世界的彩虹而命名的。据传蝴蝶花曾经救过六世纪法兰克国王克洛维的性命——当时他看到蝴蝶花生长在莱茵河中，于是推测河水很浅，可以穿过去，从而逃脱了敌人的追捕。'
),
(   null,
    'lihua_s.png',
    'lihua.jpg',
    '【梨花】',
    25,
    '梨花，蔷薇科梨属，春季开花，花色洁白，如同雪花，具有浓烈香味。',
    '梨花在我国约有2000余年的栽培历史，种类及品种均较多,历史悠久，自古以来深受人们的喜爱，其素淡的芳姿更是博得诗人的推崇。原产我国，栽培遍及全国。梨在我国产量之盛，时间之长仅次于苹果。'
),
(   null,
    'muxiuqiu_s.png',
    'muxiuqiu.jpg',
    '【木绣球】',
    66,
    '又称琼花、聚八仙、蝴蝶花，牛耳抱珠。忍冬科落叶的半常绿灌木。4、5月间开花，花大如盘，洁白如玉。',
    '琼花的寿命较长，扬州大明寺内一株清朝康熙年间种植的琼花，已有300多年的历史，如今依然繁茂，风姿如故，风韵仍不减当年。 琼花的美，是一种独具风韵的美。它不以花色鲜艳迷人，不以浓香醉人，每到春夏之交，自然界一片姹紫嫣红，琼花却花开洁白如玉，风姿绰约，格外清秀淡雅；'
),
(   null,
    'mulanhua_s.png',
    'mulanhua.jpg',
    '【木兰花】',
    88,
    '落叶小乔木，高可达5米。木质有香气，小枝紫褐色。',
    '木兰花树高可达5米，花朵开放时傲立枝头，纯白圣洁，因为木兰花是先开花，花谢后才长叶，所以木兰花开时满树洁白，毫无杂色，让人陡生敬仰之感。所以，木兰花花语就是高尚的灵魂。'
),
(   null,
    'shanmaidong_s.png',
    'shanmaidong.jpg',
    '【山麦冬】',
    15,
    '山麦冬生性喜阴湿，忌阳光直射，分布于东北、内蒙古、青海、新疆、西藏各省等地区。',
    '山麦冬为百合科植物湖北山麦冬或短葶山麦冬的干燥块根，山麦冬别名大麦冬、土麦冬、鱼子兰、麦门冬，山麦冬有养阴生津、润肺清心的功效，山麦冬有治疗肺燥干咳、虚劳咳嗽、津伤口渴、心烦失眠、肠燥便秘的作用。'
),
(   null,
    'shuixian.png',
    'shuixian.jpg',
    '【水仙】',
    24,
    '水仙性喜温暖、湿润、排水良好。在中国已有一千多年栽培历史，为传统观赏花卉。',
    '中国水仙的原种为唐代从意大利引进，是法国多花水仙的变种，在中国已有一千多年栽培历史，经上千年的选育而成为世界水仙花中独树一帜的佳品，为中国十大传统名花之一。水仙鳞茎多液汁，有毒，含有石蒜碱、多花水仙碱等多种生物碱；外科用作镇痛剂；鳞茎捣烂敷治痈肿。牛羊误食鳞茎，立即出现痉挛、瞳孔放大、暴泻等。'
),
(   null,
    'taohua_s.png',
    'taohua.jpg',
    '【桃花】',
    22,
    '花单生，从淡至深粉红或红色，有时为白色，有短柄，直径4厘米，早春开花。',
    '桃较重要的变种有：油桃 、蟠桃、寿星桃、碧桃。其中油桃和蟠桃都作果树栽培，寿星桃和碧桃主要供观赏，寿星桃还可作桃的矮化砧。'
);

##SELECT * FROM lv_flower;

CREATE TABLE lv_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,
    phone VARCHAR(16),
    user_name VARCHAR(16),
    sex INT,    /*1:男  2:女*/
    order_time LONG,
    addr VARCHAR(256),
    did INT
);
INSERT INTO lv_order(oid, phone,user_name,sex,order_time,addr,did) VALUES
(NULL,'18687085113','金秋',2,1445154859209,'杭州萧山湘湖',3),
(NULL,'18687085113','金秋',2,1445254959209,'杭州萧山湘湖',2),
(NULL,'18687085113','金秋',2,1445354959209,'杭州萧山湘湖',5);

##SELECT * FROM lv_order;